# Feature Engineering

In [15]:
import pandas as pd
import numpy as np

df = pd.read_json('../db/renthop_train.json')
df['created'] = pd.to_datetime(df['created'])
df.head()

,bathrooms,bedrooms,building_id,created,description,display_address,features,latitude,listing_id,longitude,manager_id,photos,price,street_address,interest_level
4,1.0,1,8579a0b0d54db803821a35a4a615e97a,2016-06-16 05:55:27,Spacious 1 Bedroom 1 Bathroom in Williamsburg!...,145 Borinquen Place,"[Dining Room, Pre-War, Laundry in Building, Di...",40.7108,7170325,-73.9539,a10db4590843d78c784171a107bdacb4,[https://photos.renthop.com/2/7170325_3bb5ac84...,2400,145 Borinquen Place,medium
6,1.0,2,b8e75fc949a6cd8225b455648a951712,2016-06-01 05:44:33,BRAND NEW GUT RENOVATED TRUE 2 BEDROOMFind you...,East 44th,"[Doorman, Elevator, Laundry in Building, Dishw...",40.7513,7092344,-73.9722,955db33477af4f40004820b4aed804a0,[https://photos.renthop.com/2/7092344_7663c19a...,3800,230 East 44th,low
9,1.0,2,cd759a988b8f23924b5a2058d5ab2b49,2016-06-14 15:19:59,**FLEX 2 BEDROOM WITH FULL PRESSURIZED WALL**L...,East 56th Street,"[Doorman, Elevator, Laundry in Building, Laund...",40.7575,7158677,-73.9625,c8b10a317b766204f08e613cef4ce7a0,[https://photos.renthop.com/2/7158677_c897a134...,3495,405 East 56th Street,medium
10,1.5,3,53a5b119ba8f7b61d4e010512e0dfc85,2016-06-24 07:54:24,A Brand New 3 Bedroom 1.5 bath ApartmentEnjoy ...,Metropolitan Avenue,[],40.7145,7211212,-73.9425,5ba989232d0489da1b5f2c45f6688adc,[https://photos.renthop.com/2/7211212_1ed4542e...,3000,792 Metropolitan Avenue,medium
15,1.0,0,bfb9405149bfff42a92980b594c28234,2016-06-28 03:50:23,Over-sized Studio w abundant closets. Availabl...,East 34th Street,"[Doorman, Elevator, Fitness Center, Laundry in...",40.7439,7225292,-73.9743,2c3b41f588fbb5234d8a1e885a436cfa,[https://photos.renthop.com/2/7225292_901f1984...,2795,340 East 34th Street,low

10 признаков

1. сколько фото — из photos, просто len()

In [16]:
df['num_photos'] = df['photos'].apply(len)
df[['listing_id', 'num_photos']].head(10)

    listing_id  num_photos
4      7170325          12
6      7092344           6
9      7158677           6
10     7211212           5
15     7225292           4
16     7226687           5
18     7126989           7
19     7114138           5
23     7131094           4
32     7224815          11

2. сколько удобств в списке — из features, len()

In [17]:
df['num_features'] = df['features'].apply(len)
df[['listing_id', 'num_features']].head(10)

    listing_id  num_features
4      7170325             7
6      7092344             6
9      7158677             6
10     7211212             0
15     7225292             4
16     7226687             6
18     7126989             5
19     7114138             5
23     7131094             1
32     7224815             2

3. длина описания в символах — из description

In [18]:
df['description_len'] = df['description'].fillna('').apply(len)
df[['listing_id', 'description_len']].head(10)

    listing_id  description_len
4      7170325              553
6      7092344              827
9      7158677              799
10     7211212              588
15     7225292              344
16     7226687              907
18     7126989              489
19     7114138              439
23     7131094              379
32     7224815             1374

4. квартал (1–4) из created — на паре делали час/месяц, квартал не трогали

In [19]:
df['created_quarter'] = df['created'].dt.quarter
df[['listing_id', 'created', 'created_quarter']].head(10)

    listing_id             created  created_quarter
4      7170325 2016-06-16 05:55:27                2
6      7092344 2016-06-01 05:44:33                2
9      7158677 2016-06-14 15:19:59                2
10     7211212 2016-06-24 07:54:24                2
15     7225292 2016-06-28 03:50:23                2
16     7226687 2016-06-28 05:59:06                2
18     7126989 2016-06-08 06:21:36                2
19     7114138 2016-06-05 05:28:22                2
23     7131094 2016-06-09 04:42:03                2
32     7224815 2016-06-28 03:26:18                2

5. число слов в описании — description.split()

In [20]:
df['description_word_count'] = df['description'].fillna('').apply(lambda s: len(s.split()))
df[['listing_id', 'description_word_count', 'description_len']].head(10)

    listing_id  description_word_count  description_len
4      7170325                      75              553
6      7092344                     129              827
9      7158677                     117              799
10     7211212                      93              588
15     7225292                      39              344
16     7226687                     128              907
18     7126989                      69              489
19     7114138                      60              439
23     7131094                      52              379
32     7224815                     196             1374

6. есть ли Doorman в features — 0 или 1

In [21]:
df['has_doorman'] = df['features'].apply(lambda x: 1 if 'Doorman' in (x if isinstance(x, list) else []) else 0)
df[['listing_id', 'has_doorman', 'features']].head(10)

    listing_id  has_doorman                                           features
4      7170325            0  [Dining Room, Pre-War, Laundry in Building, Di...
6      7092344            1  [Doorman, Elevator, Laundry in Building, Dishw...
9      7158677            1  [Doorman, Elevator, Laundry in Building, Laund...
10     7211212            0                                                 []
15     7225292            1  [Doorman, Elevator, Fitness Center, Laundry in...
16     7226687            1  [Doorman, Elevator, Loft, Dishwasher, Hardwood...
18     7126989            0  [Fireplace, Laundry in Unit, Dishwasher, Hardw...
19     7114138            0  [Elevator, Laundry in Building, Dishwasher, Ha...
23     7131094            0                                  [Hardwood Floors]
32     7224815            0                       [Cats Allowed, Dogs Allowed]

7. есть ли Elevator в features — 0 или 1

In [22]:
df['has_elevator'] = df['features'].apply(lambda x: 1 if 'Elevator' in (x if isinstance(x, list) else []) else 0)
df[['listing_id', 'has_elevator']].head(10)

    listing_id  has_elevator
4      7170325             0
6      7092344             1
9      7158677             1
10     7211212             0
15     7225292             1
16     7226687             1
18     7126989             0
19     7114138             1
23     7131094             0
32     7224815             0

8. сколько объявлений у этого менеджера — считаю по manager_id

In [23]:
manager_counts = df['manager_id'].value_counts()
df['manager_listings_count'] = df['manager_id'].map(manager_counts)
df[['listing_id', 'manager_id', 'manager_listings_count']].head(10)

    listing_id                        manager_id  manager_listings_count
4      7170325  a10db4590843d78c784171a107bdacb4                     112
6      7092344  955db33477af4f40004820b4aed804a0                      26
9      7158677  c8b10a317b766204f08e613cef4ce7a0                      93
10     7211212  5ba989232d0489da1b5f2c45f6688adc                      90
15     7225292  2c3b41f588fbb5234d8a1e885a436cfa                      55
16     7226687  30a7951cfc21240e8c46b2d079d292e5                     169
18     7126989  9f39caedae295bf81e67463e6fd0af40                     162
19     7114138  9cbfa7a31ae9dfba70b4383636d99788                     122
23     7131094  b89e62bf8cdc98e9fb8b97d9bc627197                      36
32     7224815  d5d246c9d9d4e7079e5a0fc962d2f1a7                      36

9. сколько объявлений в этом здании — по building_id

In [24]:
building_counts = df['building_id'].value_counts()
df['listings_per_building'] = df['building_id'].map(building_counts)
df[['listing_id', 'building_id', 'listings_per_building']].head(10)

    listing_id                       building_id  listings_per_building
4      7170325  8579a0b0d54db803821a35a4a615e97a                      5
6      7092344  b8e75fc949a6cd8225b455648a951712                     51
9      7158677  cd759a988b8f23924b5a2058d5ab2b49                     71
10     7211212  53a5b119ba8f7b61d4e010512e0dfc85                      3
15     7225292  bfb9405149bfff42a92980b594c28234                     86
16     7226687  300d27d8ba2adbcbc8c6f2bcbc1c6f9d                    110
18     7126989  0d01cabe55fa5192cdbcabd5c585c1ea                     44
19     7114138  d48767c37a934daaf0bbb0e58c755d0c                     20
23     7131094  d1ca33a2853e64fad6e4009d5d5d168f                      1
32     7224815  5f35dc2f0191baf109221752e6ee0c48                      2

10. студия или нет — bedrooms == 0

In [25]:
df['is_studio'] = (df['bedrooms'] == 0).astype(int)
df[['listing_id', 'bedrooms', 'is_studio']].head(10)

    listing_id  bedrooms  is_studio
4      7170325         1          0
6      7092344         2          0
9      7158677         2          0
10     7211212         3          0
15     7225292         0          1
16     7226687         3          0
18     7126989         3          0
19     7114138         0          1
23     7131094         1          0
32     7224815         3          0

все новые столбцы

In [26]:
new_cols = [
    'num_photos', 'num_features', 'description_len', 'created_quarter',
    'description_word_count', 'has_doorman', 'has_elevator',
    'manager_listings_count', 'listings_per_building', 'is_studio'
]
df[new_cols].head(15)

,num_photos,num_features,description_len,created_quarter,description_word_count,has_doorman,has_elevator,manager_listings_count,listings_per_building,is_studio
4,12,7,553,2,75,0,0,112,5,0
6,6,6,827,2,129,1,1,26,51,0
9,6,6,799,2,117,1,1,93,71,0
10,5,0,588,2,93,0,0,90,3,0
15,4,4,344,2,39,1,1,55,86,1
16,5,6,907,2,128,1,1,169,110,0
18,7,5,489,2,69,0,0,162,44,0
19,5,5,439,2,60,0,1,122,20,1
23,4,1,379,2,52,0,0,36,1,0
32,11,2,1374,2,196,0,0,36,2,0
33,4,5,489,2,68,1,1,34,30,1
36,5,12,689,2,109,1,1,6,152,0
38,4,11,555,2,85,1,1,115,103,1
39,6,1,551,2,81,0,0,38,11,0
42,10,8,203,2,30,1,1,39,26,0

In [27]:
df[new_cols].describe()

,num_photos,num_features,description_len,created_quarter,description_word_count,has_doorman,has_elevator,manager_listings_count,listings_per_building,is_studio
count,49352.000000,49352.000000,49352.000000,49352.0,49352.000000,49352.000000,49352.000000,49352.000000,49352.000000,49352.000000
mean,5.606946,5.428473,601.975624,2.0,87.613065,0.423448,0.525105,212.589480,1422.217864,0.191988
std,3.632283,3.923411,393.592337,0.0,58.666747,0.494110,0.499374,552.240824,3083.513973,0.393868
min,0.000000,0.000000,0.000000,2.0,0.000000,0.000000,0.000000,1.000000,1.000000,0.000000
25%,4.000000,2.000000,340.000000,2.0,48.000000,0.000000,0.000000,17.000000,7.000000,0.000000
50%,5.000000,5.000000,564.000000,2.0,81.000000,0.000000,1.000000,46.000000,25.000000,0.000000
75%,7.000000,8.000000,809.000000,2.0,117.000000,1.000000,1.000000,120.000000,110.250000,0.000000
max,68.000000,39.000000,4466.000000,2.0,663.000000,1.000000,1.000000,2533.000000,8286.000000,1.000000